app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
      if !artist
        flash[:alert] = "Artist not found"
        redirect_to artists_path
      else
        @songs = artist.songs
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"

  def show
    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
      if !artist
        redirect_to artist_path
      else
        @song = Song.find_by id: params[:id]
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]